; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	infrared1 - mode
	image0 - mode
	infrared2 - mode
	thermograph4 - mode
	thermograph5 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph5)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(have_image Phenomenon5 image0)
	(have_image Planet6 image0)
	(have_image Planet7 thermograph5)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon8 thermograph5)
	(have_image Planet9 infrared1)
	(have_image Planet9 image0)
	(have_image Phenomenon10 thermograph4)
	(have_image Phenomenon10 thermograph5)
	(have_image Planet11 infrared2)
	(have_image Planet11 image3)
	(have_image Star12 thermograph5)
	(have_image Star13 image3)
	(have_image Star13 thermograph4)
	(have_image Phenomenon14 thermograph5)
	(have_image Phenomenon14 thermograph4)
	(have_image Star15 image3)
	(have_image Star15 infrared2)
))

)

; plan
1. (turn_to satellite0 star4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star4)
   goals met: 0 of 18
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 18
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 18
4. (turn_to satellite0 star13 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star13)
   goals met: 0 of 18
5. (take_image satellite0 star13 instrument1 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 1 of 18
6. (turn_to satellite0 phenomenon8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 18
7. (take_image satellite0 phenomenon8 instrument1 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 2 of 18
8. (turn_to satellite0 phenomenon14 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 18
9. (take_image satellite0 phenomenon14 instrument1 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 3 of 18
10. (turn_to satellite0 phenomenon10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 18
11. (take_image satellite0 phenomenon10 instrument1 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 4 of 18
12. (turn_to satellite0 star2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star2)
   goals met: 4 of 18
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 18
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 18
15. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 4 of 18
16. (turn_to satellite0 phenomenon10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 18
17. (take_image satellite0 phenomenon10 instrument0 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 5 of 18
18. (turn_to satellite0 phenomenon14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 18
19. (take_image satellite0 phenomenon14 instrument0 thermograph5)
   added: (have_image phenomenon14 thermograph5)
   goals met: 6 of 18
20. (turn_to satellite0 phenomenon5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon5)
   goals met: 6 of 18
21. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 7 of 18
22. (turn_to satellite0 phenomenon8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 18
23. (take_image satellite0 phenomenon8 instrument0 thermograph5)
   added: (have_image phenomenon8 thermograph5)
   goals met: 8 of 18
24. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 8 of 18
25. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 9 of 18
26. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 9 of 18
27. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 10 of 18
28. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 10 of 18
29. (take_image satellite0 planet7 instrument0 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 11 of 18
30. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 11 of 18
31. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 12 of 18
32. (take_image satellite0 planet9 instrument0 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 13 of 18
33. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 13 of 18
34. (take_image satellite0 star12 instrument0 thermograph5)
   added: (have_image star12 thermograph5)
   goals met: 14 of 18
35. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 14 of 18
36. (take_image satellite0 star15 instrument0 infrared2)
   added: (have_image star15 infrared2)
   goals met: 15 of 18
37. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 15 of 18
38. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 15 of 18
39. (turn_to satellite0 star0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star0)
   goals met: 15 of 18
40. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 15 of 18
41. (turn_to satellite0 planet11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet11)
   goals met: 15 of 18
42. (take_image satellite0 planet11 instrument2 image3)
   added: (have_image planet11 image3)
   goals met: 16 of 18
43. (turn_to satellite0 star13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star13)
   goals met: 16 of 18
44. (take_image satellite0 star13 instrument2 image3)
   added: (have_image star13 image3)
   goals met: 17 of 18
45. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 17 of 18
46. (take_image satellite0 star15 instrument2 image3)
   added: (have_image star15 image3)
   goals met: 18 of 18
